package lesson5;

//Домашнее задание Java1. Level1. Step5
//        1. Создать классы Собака, Лошадь, Птица и Кот с наследованием от класса Животное.
//        2. Животные могут выполнять действия: бежать, плыть, перепрыгивать препятствие.
//        В качестве параметра каждому методу передается величина, означающая или длину препятствия
//        (для бега и плавания), или высоту (для прыжков).
//        3. У каждого животного есть ограничения на действия (бег: кот 200 м., собака 500 м., Лошадь 1500 м.,
//        Птица 5 м.,; прыжок: кот 2 м., собака 0.5 м., Лошадь 3 м., Птица 0.2 м. ; плавание: кот и птица
//        не умеет плавать, собака 10 м., лошадь 100 м.).
//        4. При попытке животного выполнить одно из этих действий, оно должно сообщить результат.
//        (Например, dog1.run(150); -> результат: 'Пёсик пробежал!')
//        5. * Добавить животным разброс в ограничениях. То есть у одной собаки ограничение на бег
//        может быть 400 м., у другой 600 м.

public class HomeWork5 {

    public static void main(String[] args) {

        Animals horse1 = new Horse(1500.0, 3.0, 100.0, "Horse-1");
        Animals horse2 = new Horse(1800.0, 5.0, 200.0, "Horse-2");

        Animals bird1 = new Bird(5.0, 0.2, "Bird-1");
        Animals bird2 = new Bird(10.0, 1.0, "Bird-2");

        Animals dog1 = new Dog(500.0, 0.5, 10.0, "Dog-1");
        Animals dog2 = new Dog(1000.0, 1.0, 20.0, "Dog-2");

        Animals cat1 = new Cat(200.0, 2.0, "Cat-1");
        Animals cat2 = new Cat(400.0, 4.0, "Cat-2");

//-----------------------------Horse---------------------------------

        horse1.run(1400.0);
        horse1.jump(2.5);
        horse1.swim(95.0);

        horse2.run(1700.0);
        horse2.jump(4.0);
        horse2.swim(210.0);

//-----------------------------Bird-----------------------------------

        bird1.run(4.0);
        bird1.jump(0.1);
        bird1.swim(10.0);

        bird2.run(5.0);
        bird2.jump(1.0);
        bird2.swim(0.0);

//------------------------------Dog-------------------------------------

        dog1.run(450.0);
        dog1.jump(0.4);
        dog1.swim(9.0);

        dog2.run(900.0);
        dog2.jump(1.0);
        dog2.swim(19.0);

//------------------------------Cat-------------------------------------

        cat1.run(190.0);
        cat1.jump(1.5);
        cat1.swim(0.0);

        cat2.run(300.0);
        cat2.jump(3.0);
        cat2.swim(1000);

    }

}
